dvtung0611/STM32-Embedded-Framework/drivers/stm32f407/mcu/src/spi-driver.c
/**
 * File name: spi-driver.c
 *
 * Created on: 01/05/2026
 * Author: Van Tung Dinh
 */

#include "stm32f407xx.h"
#include "spi-driver.h"


static uint32_t SPI_GetPendingInterrupts(SPI_RegDef_t *pSPIx);

static uint8_t SPI_TXE_InterruptActive(SPI_RegDef_t *pSPIx);
static uint8_t SPI_RXNE_InterruptActive(SPI_RegDef_t *pSPIx);
static uint8_t SPI_OVR_InterruptActive(SPI_RegDef_t *pSPIx);

static void SPI_TXE_InterruptHandle(SPI_Handle_t *pSPI_Handle);
static void SPI_CloseTransmission(SPI_Handle_t *pSPI_Handle);

static void SPI_RXNE_InterruptHandle(SPI_Handle_t *pSPI_Handle);
static void SPI_CloseReception(SPI_Handle_t *pSPI_Handle);

static void SPI_OVR_InterruptHandle(SPI_Handle_t *pSPI_Handle);


/* ====================================================== APIs ====================================================== */

void SPI_PeriClock_Control(SPI_RegDef_t *pSPIx, uint8_t EN_or_DI)
{
    if (EN_or_DI == ENABLE)
    {
        if (pSPIx == SPI1)
            SPI1_PCLK_EN();
        else if (pSPIx == SPI2)
            SPI2_PCLK_EN();
        else if (pSPIx == SPI3)
            SPI3_PCLK_EN();
    }
    else if (EN_or_DI == DISABLE)
    {
        if (pSPIx == SPI1)
            SPI1_PCLK_DI();
        else if (pSPIx == SPI2)
            SPI2_PCLK_DI();
        else if (pSPIx == SPI3)
            SPI3_PCLK_DI();
    }
}


void SPI_Init(SPI_Handle_t *pSPI_Handle)
{
    SPI_RegDef_t *pSPIx = pSPI_Handle->pSPIx;
    SPI_DeviceMode_t DeviceMode = pSPI_Handle->SPI_Config.SPI_DeviceMode;
    SPI_BusConfig_t BusConfig = pSPI_Handle->SPI_Config.SPI_BusConfig;
    SPI_SCLKSpeed_t SCLKSpeed = pSPI_Handle->SPI_Config.SPI_SCLKSpeed;
    SPI_DFF_t DFF = pSPI_Handle->SPI_Config.SPI_DFF;
    SPI_CPOL_t CPOL = pSPI_Handle->SPI_Config.SPI_CPOL;
    SPI_CPHA_t CPHA = pSPI_Handle->SPI_Config.SPI_CPHA;
    SPI_SSM_t SSM = pSPI_Handle->SPI_Config.SPI_SSM;

    // Enable clock for the SPI peripheral
    SPI_PeriClock_Control(pSPIx, ENABLE);

    // Reset the SPI Control Register 1
    pSPIx->CR1 = SPI_CR1_RESET_VALUE;

    // Configure the device mode
    pSPIx->CR1 |= (DeviceMode << SPI_CR1_MSTR);

    // Configure the communication mode
    if (BusConfig == SPI_BUSCONFIG_FULL_DUPLEX) // 2-line full duplex
    {
        CLEAR_BIT(pSPIx->CR1, SPI_CR1_BIDIMODE);
        CLEAR_BIT(pSPIx->CR1, SPI_CR1_RXONLY);
    }
    else if (BusConfig == SPI_BUSCONFIG_HALF_DUPLEX) // 1-line half duplex
    {
        WRITE_BIT(pSPIx->CR1, SPI_CR1_BIDIMODE);
        CLEAR_BIT(pSPIx->CR1, SPI_CR1_RXONLY);
        // TX mode: BIDIOE = 1
        // RX mode: BIDIOE = 0
        // Direction controlled at runtime
    }
    else if (BusConfig == SPI_BUSCONFIG_SIMPLEX_RX) // 2-line receive-only
    {
        CLEAR_BIT(pSPIx->CR1, SPI_CR1_BIDIMODE);
        WRITE_BIT(pSPIx->CR1, SPI_CR1_RXONLY);
    }

    // Configure SCLK speed
    pSPIx->CR1 |= (SCLKSpeed << SPI_CR1_BR);

    // Configure data frame format
    pSPIx->CR1 |= (DFF << SPI_CR1_DFF);

    // Configure CPOL
    pSPIx->CR1 |= (CPOL << SPI_CR1_CPOL);

    // Configure CPHA
    pSPIx->CR1 |= (CPHA << SPI_CR1_CPHA);

    // Configure SSM
    pSPIx->CR1 |= (SSM << SPI_CR1_SSM);
}


void SPI_DeInit(SPI_RegDef_t *pSPIx)
{
    if (pSPIx == SPI1)
        SPI1_REG_RESET();
    else if (pSPIx == SPI2)
        SPI2_REG_RESET();
    else if (pSPIx == SPI3)
        SPI3_REG_RESET();
}


uint8_t SPI_GetFlagStatus(SPI_RegDef_t *pSPIx, uint8_t FlagName)
{
    return ((pSPIx->SR >> FlagName) & 1U);
}


void SPI_PeripheralControl(SPI_RegDef_t *pSPIx, uint8_t EN_or_DI)
{
    if (EN_or_DI == ENABLE)
        WRITE_BIT(pSPIx->CR1, SPI_CR1_SPE);
    else if (EN_or_DI == DISABLE)
        CLEAR_BIT(pSPIx->CR1, SPI_CR1_SPE);
}


void SPI_SSIConfig(SPI_RegDef_t *pSPIx, uint8_t EN_or_DI)
{
    if (EN_or_DI == SET)
        WRITE_BIT(pSPIx->CR1, SPI_CR1_SSI);
    else if (EN_or_DI == RESET)
        CLEAR_BIT(pSPIx->CR1, SPI_CR1_SSI);
}


void SPI_SSOEConfig(SPI_RegDef_t *pSPIx, uint8_t EN_or_DI)
{
    if (EN_or_DI == SET)
        WRITE_BIT(pSPIx->CR2, SPI_CR2_SSOE);
    else if (EN_or_DI == RESET)
        CLEAR_BIT(pSPIx->CR2, SPI_CR2_SSOE);
}


static uint8_t SPI_TXE_InterruptActive(SPI_RegDef_t *pSPIx)
{
    return READ_BIT(pSPIx->SR, SPI_SR_TXE) & READ_BIT(pSPIx->CR2, SPI_CR2_TXEIE);
}


static uint8_t SPI_RXNE_InterruptActive(SPI_RegDef_t *pSPIx)
{
    return READ_BIT(pSPIx->SR, SPI_SR_RXNE) & READ_BIT(pSPIx->CR2, SPI_CR2_RXNEIE);
}


static uint8_t SPI_OVR_InterruptActive(SPI_RegDef_t *pSPIx)
{
    return READ_BIT(pSPIx->SR, SPI_SR_OVR) & READ_BIT(pSPIx->CR2, SPI_CR2_ERRIE);
}


static uint32_t SPI_GetPendingInterrupts(SPI_RegDef_t *pSPIx)
{
    uint32_t events = 0;

    if (SPI_TXE_InterruptActive(pSPIx))
        events |= SPI_IRQ_EVENT_TXE;
    
    if (SPI_RXNE_InterruptActive(pSPIx))
        events |= SPI_IRQ_EVENT_RXNE;
    
    if (SPI_OVR_InterruptActive(pSPIx))
        events |= SPI_IRQ_EVENT_OVR_ERROR;
    
    return events;
}


void SPI_IRQHandling(SPI_Handle_t *pSPI_Handle)
{
    uint32_t events = SPI_GetPendingInterrupts(pSPI_Handle->pSPIx);

    if (events & SPI_IRQ_EVENT_TXE)
        SPI_TXE_InterruptHandle(pSPI_Handle);
    
    if (events & SPI_IRQ_EVENT_RXNE)
        SPI_RXNE_InterruptHandle(pSPI_Handle);

    if (events & SPI_IRQ_EVENT_OVR_ERROR)
        SPI_OVR_InterruptHandle(pSPI_Handle);
}


static void SPI_TXE_InterruptHandle(SPI_Handle_t *pSPI_Handle)
{
    SPI_RegDef_t *pSPIx = pSPI_Handle->pSPIx;

    // Transmit data
    if (READ_BIT(pSPIx->CR1, SPI_CR1_DFF))
    {
        // 16-bit data frame
        *((volatile uint16_t *)(&pSPIx->DR)) = *((uint16_t *)(pSPI_Handle->pCurrentTransfer->pTxBuffer));
        pSPI_Handle->pCurrentTransfer->TxLength -= 2;
        pSPI_Handle->pCurrentTransfer->pTxBuffer += 2;
    }
    else
    {
        // 8-bit data frame
        *((volatile uint8_t *)(&pSPIx->DR)) = *((uint8_t *)(pSPI_Handle->pCurrentTransfer->pTxBuffer));
        pSPI_Handle->pCurrentTransfer->TxLength -= 1;
        pSPI_Handle->pCurrentTransfer->pTxBuffer += 1;
    }

    // Close transmission
    if (pSPI_Handle->pCurrentTransfer->TxLength == 0)
    {
        SPI_CloseTransmission(pSPI_Handle);
        SPI_ApplicationEventCallBack(pSPI_Handle, SPI_APP_EVENT_TX_BUFFER_EMPTY);
    }
}


static void SPI_CloseTransmission(SPI_Handle_t *pSPI_Handle)
{
    SPI_RegDef_t *pSPIx = pSPI_Handle->pSPIx;

    // Disable TXE interrupt
    CLEAR_BIT(pSPIx->CR2, SPI_CR2_TXEIE);

    pSPI_Handle->pCurrentTransfer->pTxBuffer = NULL;
    pSPI_Handle->pCurrentTransfer->TxLength = 0;
    pSPI_Handle->State = SPI_PERI_STATE_READY;
}


static void SPI_RXNE_InterruptHandle(SPI_Handle_t *pSPI_Handle)
{
    SPI_RegDef_t *pSPIx = pSPI_Handle->pSPIx;

    // Receive data
    if (READ_BIT(pSPIx->CR1, SPI_CR1_DFF))
    {
        // 16-bit data frame
        *((uint16_t *)(pSPI_Handle->pCurrentTransfer->pRxBuffer)) = *((volatile uint16_t *)(&pSPIx->DR));
        pSPI_Handle->pCurrentTransfer->RxLength -= 2;
        pSPI_Handle->pCurrentTransfer->pRxBuffer += 2;
    }
    else
    {
        // 8-bit data frame
        *((uint8_t *)(pSPI_Handle->pCurrentTransfer->pRxBuffer)) = *((volatile uint8_t *)(&pSPIx->DR));
        pSPI_Handle->pCurrentTransfer->RxLength -= 1;
        pSPI_Handle->pCurrentTransfer->pRxBuffer += 1;
    }

    // Close reception
    if (pSPI_Handle->pCurrentTransfer->RxLength == 0)
    {
        SPI_CloseReception(pSPI_Handle);
        SPI_ApplicationEventCallBack(pSPI_Handle, SPI_APP_EVENT_RX_BUFFER_FULL);
    }
}


static void SPI_CloseReception(SPI_Handle_t *pSPI_Handle)
{
    SPI_RegDef_t *pSPIx = pSPI_Handle->pSPIx;

    // Disable RXNE interrupt
    CLEAR_BIT(pSPIx->CR2, SPI_CR2_RXNEIE);

    pSPI_Handle->pCurrentTransfer->pRxBuffer = NULL;
    pSPI_Handle->pCurrentTransfer->RxLength = 0;
    pSPI_Handle->State = SPI_PERI_STATE_READY;
}


static void SPI_OVR_InterruptHandle(SPI_Handle_t *pSPI_Handle)
{
    // Clear OVR flag
    if (pSPI_Handle->State != SPI_PERI_STATE_BUSY_TX)
    {
        SPI_ClearOVRFlag(pSPI_Handle->pSPIx);
        SPI_ApplicationEventCallBack(pSPI_Handle, SPI_APP_EVENT_OVR_ERROR);
    }
}


__weak void SPI_ApplicationEventCallBack(SPI_Handle_t *pSPI_Handle, SPI_AppEvent_t SPI_AppEventFlag)
{
    (void)pSPI_Handle;
    (void)SPI_AppEventFlag;
}


uint8_t SPI_CheckReady(SPI_Handle_t *pSPI_Handle)
{
    return pSPI_Handle->State == SPI_PERI_STATE_READY;
}


uint8_t SPI_CheckBusy(SPI_Handle_t *pSPI_Handle)
{
    return pSPI_Handle->State != SPI_PERI_STATE_READY;
}


uint8_t SPI_CheckError(SPI_Handle_t *pSPI_Handle)
{
    return pSPI_Handle->State == SPI_PERI_STATE_ERROR;
}


void SPI_ClearOVRFlag(SPI_RegDef_t *pSPIx)
{
    (void)pSPIx->DR;
    (void)pSPIx->SR;
}


SPI_FunctionStatus_t SPI_Transmit(SPI_RegDef_t *pSPIx, uint8_t *pTxBuffer, uint32_t TxLength)
{
    if ((READ_BIT(pSPIx->CR1, SPI_CR1_DFF) == SET) && (TxLength % 2 == 1))
        return SPI_FUNC_STATUS_ERROR;

    while (TxLength > 0)
    {
        // Wait until TX buffer is empty (TXE = SET)
        while (SPI_GetFlagStatus(pSPIx, SPI_FLAG_TXE) == RESET);
        
        // Send data
        if (READ_BIT(pSPIx->CR1, SPI_CR1_DFF) == SET)
        {
            // 16-bit data frame format is selected for transmission
            *((volatile uint16_t *)(&pSPIx->DR)) = *((uint16_t *)(pTxBuffer));
            TxLength -= 2;
            pTxBuffer += 2;
        }
        else
        {
            // 8-bit data frame format is selected for transmission
            *((volatile uint8_t *)(&pSPIx->DR)) = *((uint8_t *)(pTxBuffer));
            TxLength -= 1;
            pTxBuffer += 1;
        }
        
        // Wait until RX buffer is full (not empty) (RXNE = SET)
        while (SPI_GetFlagStatus(pSPIx, SPI_FLAG_RXNE) == RESET);
        
        // Read data
        (void)pSPIx->DR;
    }

    // Wait until SPI peripheral transmit and receive everything done
    while (SPI_GetFlagStatus(pSPIx, SPI_SR_BSY) == SET);

    return SPI_FUNC_STATUS_OK;
}


SPI_FunctionStatus_t SPI_Receive(SPI_RegDef_t *pSPIx, uint8_t *pRxBuffer, uint32_t RxLength)
{
    if ((READ_BIT(pSPIx->CR1, SPI_CR1_DFF) == SET) && (RxLength % 2 == 1))
        return SPI_FUNC_STATUS_ERROR;

    while (RxLength > 0)
    {
        // Wait until TX buffer is empty (TXE = SET)
        while (SPI_GetFlagStatus(pSPIx, SPI_FLAG_TXE) == RESET);
        
        // Send data
        if (READ_BIT(pSPIx->CR1, SPI_CR1_DFF) == SET)
        {
            // 16-bit data frame format is selected for transmission
            *((volatile uint16_t *)(&pSPIx->DR)) = 0xFFFF; // Send dummy frame
        }
        else
        {
            // 8-bit data frame format is selected for transmission
            *((volatile uint8_t *)(&pSPIx->DR)) = 0xFF; // Send dummy frame
        }

        // Wait until RX buffer is full (not empty) (RXNE = SET)
        while (SPI_GetFlagStatus(pSPIx, SPI_FLAG_RXNE) == RESET);

        // Read data
        if (READ_BIT(pSPIx->CR1, SPI_CR1_DFF) == SET)
        {
            // 16-bit data frame format is selected for reception
            *((uint16_t *)(pRxBuffer)) = *((volatile uint16_t *)(&pSPIx->DR));
            RxLength -= 2;
            pRxBuffer += 2;
        }
        else
        {
            // 8-bit data frame format is selected for reception
            *((uint8_t *)(pRxBuffer)) = *((volatile uint8_t *)(&pSPIx->DR));
            RxLength -= 1;
            pRxBuffer += 1;
        }
    }

    // Wait until SPI peripheral transmit and receive everything done
    while (SPI_GetFlagStatus(pSPIx, SPI_SR_BSY) == SET);

    return SPI_FUNC_STATUS_OK;
}


SPI_FunctionStatus_t SPI_TransmitReceive(SPI_RegDef_t *pSPIx, uint8_t *pTxBuffer, uint32_t TxLength, uint8_t *pRxBuffer, uint32_t RxLength)
{
    if ((READ_BIT(pSPIx->CR1, SPI_CR1_DFF) == SET) && 
        ((TxLength % 2 == 1) || (RxLength % 2 == 1)))
        return SPI_FUNC_STATUS_ERROR;

    while (RxLength > 0)
    {
        // Wait until TX buffer is empty (TXE = SET)
        while (SPI_GetFlagStatus(pSPIx, SPI_FLAG_TXE) == RESET);
        
        // Send data
        if (READ_BIT(pSPIx->CR1, SPI_CR1_DFF) == SET)
        {
            // 16-bit data frame format is selected for transmission
            *((volatile uint16_t *)(&pSPIx->DR)) = *((uint16_t *)(pTxBuffer));
            TxLength -= 2;
            pTxBuffer += 2;
        }
        else
        {
            // 8-bit data frame format is selected for transmission
            *((volatile uint8_t *)(&pSPIx->DR)) = *((uint8_t *)(pTxBuffer));
            TxLength -= 1;
            pTxBuffer += 1;
        }

        // Wait until RX buffer is full (not empty) (RXNE = SET)
        while (SPI_GetFlagStatus(pSPIx, SPI_FLAG_RXNE) == RESET);

        // Read data
        if (READ_BIT(pSPIx->CR1, SPI_CR1_DFF) == SET)
        {
            // 16-bit data frame format is selected for reception
            *((uint16_t *)(pRxBuffer)) = *((volatile uint16_t *)(&pSPIx->DR));
            RxLength -= 2;
            pRxBuffer += 2;
        }
        else
        {
            // 8-bit data frame format is selected for reception
            *((uint8_t *)(pRxBuffer)) = *((volatile uint8_t *)(&pSPIx->DR));
            RxLength -= 1;
            pRxBuffer += 1;
        }
    }

    // Wait until SPI peripheral transmit and receive everything done
    while (SPI_GetFlagStatus(pSPIx, SPI_SR_BSY) == SET);

    return SPI_FUNC_STATUS_OK;
}


SPI_FunctionStatus_t SPI_TransmitIT(SPI_Handle_t *pSPI_Handle, SPI_Transfer_t *pSPI_Transfer)
{
    if (pSPI_Handle == NULL || pSPI_Transfer == NULL || pSPI_Transfer->pTxBuffer == NULL || pSPI_Transfer->TxLength == 0)
        return SPI_FUNC_STATUS_INVALID_PARAMETER;
    
    if (pSPI_Handle->State != SPI_PERI_STATE_READY)
        return SPI_FUNC_STATUS_BUSY;
    
    pSPI_Handle->pCurrentTransfer = pSPI_Transfer;
    pSPI_Handle->State = SPI_PERI_STATE_BUSY_TX;

    // Enable ERROR interrupt
    WRITE_BIT(pSPI_Handle->pSPIx->CR2, SPI_CR2_ERRIE);

    // Enable TXE interrupt
    WRITE_BIT(pSPI_Handle->pSPIx->CR2, SPI_CR2_TXEIE);

    return SPI_FUNC_STATUS_OK;
}


SPI_FunctionStatus_t SPI_ReceiveIT(SPI_Handle_t *pSPI_Handle, SPI_Transfer_t *pSPI_Transfer)
{
    if (pSPI_Handle == NULL || pSPI_Transfer == NULL || pSPI_Transfer->pRxBuffer == NULL || pSPI_Transfer->RxLength == 0)
        return SPI_FUNC_STATUS_INVALID_PARAMETER;
    
    if (pSPI_Handle->State != SPI_PERI_STATE_READY)
        return SPI_FUNC_STATUS_BUSY;
    
    pSPI_Handle->pCurrentTransfer = pSPI_Transfer;
    pSPI_Handle->State = SPI_PERI_STATE_BUSY_RX;

    // Enable ERROR interrupt
    WRITE_BIT(pSPI_Handle->pSPIx->CR2, SPI_CR2_ERRIE);

    // Enable RXNE interrupt
    WRITE_BIT(pSPI_Handle->pSPIx->CR2, SPI_CR2_RXNEIE);

    return SPI_FUNC_STATUS_OK;
}